app/controllers/reports/conferences_controller.rb

SELECT  "conferences".* FROM "conferences" WHERE "conferences"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "attendees".* FROM "attendees" WHERE "attendees"."conference_id" = ?  [["conference_id", 1]]
SELECT COUNT(*) FROM "attendees" WHERE "attendees"."conference_id" = ?  [["conference_id", 1]]
---
    def attendees
      @conference = Conference.includes(:attendees).find_by(id: attendee_params[:conference_id])

      if @conference
        @attendees = @conference.attendees.page(params[:page]).per(params[:per_page])