app/views/reports/events/_event.json.jbuilder

json.ends_at event.ends_at.to_datetime.to_timestamp
json.speakers_total event.speakers.count
json.attendees_total event.attendees.count
---
SELECT COUNT(*) FROM "speakers" INNER JOIN "conferences" ON "speakers"."conference_id" = "conferences"."id" WHERE "conferences"."event_id" = ?  [["event_id", 1]]
SELECT COUNT(*) FROM "attendees" INNER JOIN "conferences" ON "attendees"."conference_id" = "conferences"."id" WHERE "conferences"."event_id" = ?  [["event_id", 1]]