app/models/conference.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? ORDER BY "events"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def check_dates
    unless self.event_id.nil?
      event = Event.where(id: self.event_id).first