app/models/event.rb

  def send_emails
    success = true

    speakers.each do |speaker|
      next if speaker.email_sent

      begin
        SpeakerMailer.event_notification(speaker, self).deliver_now
        speaker.update!(email_sent: true)
---
UPDATE "speakers" SET "email_sent" = ?, "updated_at" = ? WHERE "speakers"."id" = ?  [["email_sent", 1], ["updated_at", "2024-09-10 02:00:22.917283"], ["id", 13]]